vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32670.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.7.7" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.7/schema/PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32670</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32670 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>                  <!-- YYYY-MM-DD -->
      <release version="1.1.0" date="2023-04-17">
   		- updated for Keil Compiler 6
		- updated libraries and examples for SDK for both Keil and IAR
      </release>    
      <release version="1.0.3" date="2021-10-21">
   		- updated .pdsc to match new ARM pack generation.
      </release>      
      <release version="1.0.2" date="2021-04-01">
      	- flc_me15.c updated to fix a bug
      </release>    
      <release version="1.0.1" date="2021-03-22">
      	- Fixed the .pdsc to only handle MAX32670
		- to prevent clash on the CMSIS Manager
		- with MAX32670
      </release>       
      <release version="0.1.4" date="2020-10-14">
      	- IAR and Keil Release. (Clean up).
      </release> 
      <release version="0.1.2" date="2020-08-05">
      	-Initial limited release of SDK  (IAR)
		- printf() can print floats and doubles (IAR)
      </release>   
      <release version="0.1.1" date="2020-07-01">
      	-Initial limited release of SDK
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32670</keyword>
      <!-- <keyword>MAX32671</keyword> -->
      <keyword>MAX32670 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32670 family" Dvendor="Maxim:23">
         <book name="Doc/MAX32670_datasheet.txt" title="MAX32670 Family Data Sheet"/>
         <book name="Doc/MAX32670_userguide.txt" title="MAX32670 Family Users Guide"/>         
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.h" />
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.h" define="MAX32670"/>
         <memory name="IROM1" access="rx" start="0x10000000" size="0x0005FFFF" startup="1" default="1"/>
         <memory name="IRAM1" access="rwx" start="0x20000000" size="0x00027FFF" init="0" default="1"/>
         <algorithm name="Flash/MAX32670.FLM" start="0x10000000" size="0x0005FFFF" default="1"/>
         <algorithm  name="FlashIAR/FlashMAX32670.flash" start="0x10000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00080000" default="0" style="IAR"/>
         <description>
            The MAX32670 is an ultra-low-power, cost-effective, high reliability 32-bit microcontroller enabling designs
            with complex sensor processing without compromising battery life. It combines a flexible and versatile power management
            unit with the powerful Arm Cortex-M4 core with FPU. It also offers legacy designs an easy and cost optimal upgrade path
            from 8- or 16-bit microcontrollers. Error correction coding (ECC) (single error correction double error detection) for flash,
            and SRAM provides extremely reliable code execution. The device integrates up to 384KB of flash memory and 160KB
            (128KB with ECC) of SRAM to accommodate application and sensor code.
            The device features five powerful and flexible power modes. It can operate from a single-supply battery or a dual-supply
            typically provided by a PMIC. The I2C ports support standard, fast, fast-plus, and high-speed modes, operating up to
            3400kbps. The SPI ports can run up to 48MHz in both master and slave mode, and three UARTs can run up to 4000kbaud.
            One low power UART can run up to 1000kbaud. Four general-purpose 32-bit timers, two low power 32-bit timers, two
            windowed watchdog timers, and a real-time clock are also provided. An I2S interface provides digital audio streaming to a
            codec.
         </description>     
     <!--    <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/> -->
         <!--<debug svd="SVD/MAX32670/max32670.svd" /> DELETE -->
		 <debug svd="Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.svd" version="1.1.0" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32670">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>
<!--		 
         <device Dname="MAX32671">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
            <feature type="Crypto" n="128.256" name="HW Accelerated Trust Protection Unit"/>
         </device>		 
-->
      </family>
   </devices>

   <!-- MAX32670 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32670 EvKit" revision="Rev A" salesContact="sales@maximintegrated.com">
         <description>The MAX32670 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32670 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32670_EvKit.txt" title="MAX32670 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32670_EvKitSchematic.txt" title="MAX32670 EvKit Schematic"/>
    <!--     <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/> -->
     <!--    <mountedDevice Dvendor="Maxim:23" Dname="MAX32671"/> -->
		 <mountedDevice Dvendor="Maxim:23" Dname="MAX32670"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>
  
   <!-- Evaluation Kit Example Programs -->
      
   <examples>
   
      <example name="AES" doc="ARM/Abstract.txt" folder="Examples/MAX32670/AES">
         <description>AES Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
         <environment name="uv" load="ARM/AES.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>    
	  
      <example name="CRC" doc="ARM/Abstract.txt" folder="Examples/MAX32670/CRC">
         <description>CRC Module Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CRC.ewp" />
            <environment name="uv" load="ARM/CRC.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="CRC"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
	  
      <example name="DMA" doc="ARM/Abstract.txt" folder="Examples/MAX32670/DMA">
         <description>Direct Memory Access Controller Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DMA.ewp" />
            <environment name="uv" load="ARM/DMA.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="DMA"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
 
      <example name="Flash" doc="ARM/Abstract.txt" folder="Examples/MAX32670/Flash">
         <description>Flash Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Flash.ewp" />
            <environment name="uv" load="ARM/Flash.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="FLC"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
 
 	  <example name="GPIO" doc="ARM/Abstract.txt" folder="Examples/MAX32670/GPIO">
         <description>GPIO Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/GPIO.ewp" />
            <environment name="uv" load="ARM/GPIO.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
			<component Cbundle="Maxim API" Cclass="Device" Cgroup="GPIO"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
 
      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Examples/MAX32670/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hello_World.ewp" />
            <environment name="uv" load="ARM/Hello_World.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
      <example name="I2C" doc="ARM/Abstract.txt" folder="Examples/MAX32670/I2C">
         <description>I2C Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2C.ewp" />
            <environment name="uv" load="ARM/I2C.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2C"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="ICC" doc="ARM/Abstract.txt" folder="Examples/MAX32670/ICC">
         <description>Instruction Cache Controller Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ICC.ewp" />
            <environment name="uv" load="ARM/ICC.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="ICC"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>     

      <example name="LP" doc="ARM/Abstract.txt" folder="Examples/MAX32670/LP">
         <description>Low Power Capabilities Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/LP.ewp" />
            <environment name="uv" load="ARM/LP.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Low Power"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

