vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32670.pdsc
      <example name="RTC" doc="ARM/Abstract.txt" folder="Examples/MAX32670/RTC">
         <description>Real Time Clock Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/RTC.ewp" />
            <environment name="uv" load="ARM/RTC.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="RTC" />
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

      <example name="SPI" doc="ARM/Abstract.txt" folder="Examples/MAX32670/SPI">
         <description>SPI Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPI.ewp" />
            <environment name="uv" load="ARM/SPI.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>          
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>      
      </example>
	  
      <example name="TMR" doc="ARM/Abstract.txt" folder="Examples/MAX32670/TMR">
         <description>Timer Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TMR.ewp" />
            <environment name="uv" load="ARM/TMR.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="TRNG" doc="ARM/Abstract.txt" folder="Examples/MAX32670/TRNG">
         <description>Semaphore Module Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TRNG.ewp" />
            <environment name="uv" load="ARM/TRNG.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TRNG"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>           

      <example name="UART" doc="ARM/Abstract.txt" folder="Examples/MAX32670/UART">
         <description>UART Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/UART.ewp" />
            <environment name="uv" load="ARM/UART.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="UART"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Examples/MAX32670/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Watchdog.ewp" />
            <environment name="uv" load="ARM/Watchdog.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WDT"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
	  

      <example name="I2S" doc="ARM/Abstract.txt" folder="Examples/MAX32670/I2S">
         <description>I2S Demo</description>
         <board name="MAX32670 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2S.ewp" />
            <environment name="uv" load="ARM/I2S.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32670 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2S"/>
            <component Cbundle="MAX32670 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
