vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32670.pdsc
   </examples>

   <conditions>
      <!-- MAX32670 Device Condition -->
      <condition id="MAX32670 Family">
         <description> Maxim Integrated MAX32670 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX32670"/>
         <!-- <require Dfamily="MAX32670-71"/> -->
      </condition>

      <!-- MAX32670 Device Condition -->
      <condition id="MAX32670 Device">
         <description> Maxim Integrated MAX32670 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32670"/>
      </condition>

      <!-- MAX32671 Device Condition -->
<!--      <condition id="MAX32671 Device">
         <description> Maxim Integrated MAX32670 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32671"/>
      </condition> -->

      <!-- MAX32670/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32670 CMSIS-CORE">
         <description>Maxim MAX32670 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32670 Family"/>
   <!--      <accept condition="MAX32671 Device"/> -->
		 <accept condition="MAX32670 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>



      <!-- AES Peripheral Condition -->
      <condition id="MAX32670 CMSIS AES">
         <description>AES Interface</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>
	  
      <!-- CRC Peripheral Condition -->
      <condition id="MAX32670 CMSIS CRC">
         <description>CRC</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>	
	
      <!-- Standard DMA Peripheral -->
      <condition id="MAX32670 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>	  

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32670 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32670 CMSIS-CORE"/>
         <require condition="MAX32670 CMSIS ICC"/>
      </condition>

      <!-- GPIO -->
      <condition id="MAX32670 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32670 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32670 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32670 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- Low Power -->
      <condition id="MAX32670 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32670 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32670 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- SYS -->
      <condition id="MAX32670 CMSIS SYS">
         <description>SYS Interface</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32670 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- TRNG -->
      <condition id="MAX32670 CMSIS TRNG">
         <description>Timers</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32670 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32670 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition>

      <!-- SIMO -->
<!--      <condition id="MAX32670 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32670 CMSIS-CORE"/>
      </condition> -->

      <condition id="MAX32670 BSP DEP">	  
	     <description>Board Support Package</description>
         <!-- <require condition="MAX32670 CMSIS-CORE"/> -->
         <accept condition="MAX32670 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
	  
   </conditions>	  

   <components>
<!--                                                                                
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.1.0" condition="MAX32670 Family">
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32670   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
       </component>
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="1.1.0" condition="MAX32670 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32670   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component>
-->
      <bundle Cbundle="Maxim API" Cclass="Device" Cversion="1.1.0">
         <description>Maxim Developed Hardware Abstraction Layer</description>
         <doc>Doc/SDK_Documentation/doxygen.txt</doc>

         <!-- MAX32670 Device Selection -->
         <component Cgroup="Startup" Cversion="1.1.0" condition="MAX32670 Family" >
            <description>System Startup for Maxim MAX32670 Microcontroller</description>
			
			
            <files>
               <!-- Include paths for the tools -->
               <file category="include" name="Libraries/CMSIS/Device/Maxim/MAX32670/Include/" version="1.1.0" />
               <file category="include" name="Libraries/PeriphDrivers/Include/MAX32670/" version="1.1.0" />

			   <file category="include" name="Libraries/PeriphDrivers/Source/AES/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CRC/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2S/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SYS/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TRNG/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="1.1.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="1.1.0"/>

               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->			   
               <file category="sourceAsm" attr="config" version="1.1.0" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/ARM/startup_max32670.s" condition="Startup ARM" />
                <file category="sourceC" attr="config"  version="1.1.0" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/IAR/low_level_init.c" condition="Startup IAR" />
				
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="1.1.0" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/GCC/startup_max32670.S" condition="Startup GCC" />

