vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32670.pdsc
               <!-- IAR device startup file, low level init and cmain.s -->  
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/IAR/startup_max32670.s" condition="Startup IAR" version="1.1.0" />
               <file category="sourceC" attr="config"  version="1.1.0" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="1.1.0" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/IAR/cmain.s" condition="Startup IAR" />

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="1.1.0" name="Libraries/CMSIS/Device/Maxim/MAX32670/Source/system_max32670.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.1.0" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32670/Include/max32670.h" version="1.1.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="1.1.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="1.1.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="1.1.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me15.c"  version="1.1.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me15.c"  version="1.1.0" />	   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="1.1.0" />		   
            </files>
         </component>

         <component Cgroup="AES" condition="MAX32670 CMSIS AES" Cversion="1.1.0"> 
         	 <description>AES Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_me15.c" version="1.1.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_revb.c" version="1.1.0"/>			   
            </files>
         </component>
		 
		 <component Cgroup="CRC" condition="MAX32670 CMSIS CRC" Cversion="1.1.0"> 
         	 <description>Camera Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_reva.c" version="1.1.0"/>
            </files>
         </component>		 

         <component Cgroup="DMA" condition="MAX32670 CMSIS DMA" Cversion="1.1.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="1.1.0"/>
            </files>
         </component>

         <component Cgroup="FLC" condition="MAX32670 CMSIS FLC" Cversion="1.1.0" >
            <description> Flash Controller </description>
            <files>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me15.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="1.1.0"/>		
		<!--	   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_revb.c" version="1.1.0"/> -->
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32670 CMSIS GPIO" Cversion="1.1.0">
            <description> GPIO </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="1.1.0"/>		   
            </files>
         </component>
		 
        <component Cgroup="I2C" condition="MAX32670 CMSIS I2C" Cversion="1.1.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="1.1.0"/>			   
            </files>
         </component>		 
		 
        <component Cgroup="I2S" condition="MAX32670 CMSIS I2S" Cversion="1.1.0">
            <description>I2S Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_reva.c" version="1.1.0"/>			   
            </files>
         </component>		 		 

         <component Cgroup="ICC" condition="MAX32670 CMSIS ICC" Cversion="1.1.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="1.1.0"/>			   
            </files>
         </component>		 
		 
         <component Cgroup="Low Power" condition="MAX32670 CMSIS Low Power" Cversion="1.1.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me15.c" version="1.1.0"/>			   
            </files>
         </component>		 
		 
         <component Cgroup="RTC" condition="MAX32670 CMSIS RTC" Cversion="1.1.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="1.1.0"/>			   
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32670 CMSIS SPI" Cversion="1.1.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me15.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="1.1.0"/>			   
            </files>
         </component>

         <component Cgroup="SYS" condition="MAX32670 CMSIS SYS" Cversion="1.1.0">
            <description>SYS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me15.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me15.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_es17.c" version="1.1.0"/>				   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.1.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c" version="1.1.0"/>

            </files>
         </component>

