vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32670.pdsc
         <component Cgroup="Timers" condition="MAX32670 CMSIS TIMER" Cversion="1.1.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_revb.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="1.1.0"/>			   
            </files>
         </component>

         <component Cgroup="TRNG" condition="MAX32670 CMSIS TRNG" Cversion="1.1.0">
            <description>TRNG</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_revb.c" version="1.1.0"/>		   
            </files>
         </component>

         <component Cgroup="UART" condition="MAX32670 CMSIS UART" Cversion="1.1.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_revb.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="1.1.0"/>
            </files>
         </component>

      <component Cgroup="WDT" condition="MAX32670 CMSIS WDT" Cversion="1.1.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me15.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_revb.c" version="1.1.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="1.1.0"/>
            </files>
         </component>		    
      </bundle>
	  
<!--      <bundle Cbundle="MAX32670 BSP" Cclass="BSP" Cversion="1.1.0">
         <description>MAX32670 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32670_EvKit.txt</doc>
            <component Cgroup="EvKit V1" condition="MAX32670 BSP DEP">
		    <component Cgroup="EvKit V1">
            <description>MAX32670 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
			   <file category="include" name="Libraries/Boards/MAX32670/EvKit_V1/Include/" version="1.1.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32670/EvKit_V1/Source/board.c" version="1.1.0"/>	   			   
               <file category="include" name="Libraries/Boards/MAX32670/Include/" version="1.1.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32670/Source/led.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32670/Source/pb.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32670/Source/stdio.c" version="1.1.0"/>
           </files>
         </component>
      </bundle> -->

     <bundle Cbundle="MAX32670 BSP" Cclass="BSP" Cversion="1.1.0">
         <description>MAX32670 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32670_EvKit.txt</doc>

		 <component Cgroup="Board Type" Cvariant="EvKit" Cversion="1.1.0" condition="MAX32670 Family">
            <description>MAX32670 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define EvKit_V1 /* Target Board */
            </RTE_Components_h>			
            <files>
			   <file category="include" name="Libraries/Boards/MAX32670/EvKit_V1/Include/" version="1.1.0"/>
			   <file category="include" name="Libraries/Boards/MAX32670/EvKit_V1/" version="1.1.0"/>
		<!--	   <file category="include" name="Libraries/Boards/MAX32670/FTHR_RevA/Include/" version="1.1.0"/>
			   <file category="include" name="Libraries/Boards/MAX32670/FTHR_RevA/" version="1.1.0"/>			   -->
			   <file category="include" name="Libraries/Boards/MAX32670/Include/" version="1.1.0"/>
               <file category="include" name="Libraries/MiscDrivers/Camera/" version="1.1.0"/>			   
               <file category="include" name="Libraries/MiscDrivers/Display/" version="1.1.0"/>				   
               <file category="include" name="Libraries/MiscDrivers/ExtMemory/" version="1.1.0"/>
               <file category="include" name="Libraries/MiscDrivers/LED/" version="1.1.0"/>	
               <file category="include" name="Libraries/MiscDrivers/PMIC/" version="1.1.0"/>			   
               <file category="include" name="Libraries/MiscDrivers/PushButton/" version="1.1.0"/>
               <file category="include" name="Libraries/MiscDrivers/Touchscreen/" version="1.1.0"/>				
               <file category="sourceC" name="Libraries/Boards/MAX32670/EvKit_V1/Source/board.c" version="1.1.0"/>	   			   
			   <file category="sourceC" name="Libraries/MiscDrivers/stdio.c" version="1.1.0"/>							
               <file category="sourceC" name="Libraries/Boards/MAX32670/EvKit_V1/Source/board.c" version="1.1.0"/>	   			   
			   <file category="sourceC" name="Libraries/MiscDrivers/stdio.c" version="1.1.0"/>		   
           </files>
         </component>

<!--		 <component Cgroup="Board Type" Cvariant="FTHR" Cversion="1.1.0" condition="MAX32670 Family">
            <description>MAX32670 Feather Board</description>
            <RTE_Components_h>
               #define FTHR /* Target Board */
            </RTE_Components_h>			
            <files>
			   <file category="include" name="Libraries/Boards/MAX32670/EvKit_V1/Include/" version="1.1.0"/>
			   <file category="include" name="Libraries/Boards/MAX32670/EvKit_V1/" version="1.1.0"/>
			   <file category="include" name="Libraries/Boards/MAX32670/FTHR_RevA/Include/" version="1.1.0"/>
			   <file category="include" name="Libraries/Boards/MAX32670/FTHR_RevA/" version="1.1.0"/>			   
			   <file category="include" name="Libraries/Boards/MAX32670/Include/" version="1.1.0"/>
               <file category="include" name="Libraries/MiscDrivers/Camera/" version="1.1.0"/>			   
               <file category="include" name="Libraries/MiscDrivers/Display/" version="1.1.0"/>				   
               <file category="include" name="Libraries/MiscDrivers/ExtMemory/" version="1.1.0"/>
               <file category="include" name="Libraries/MiscDrivers/LED/" version="1.1.0"/>	
               <file category="include" name="Libraries/MiscDrivers/PMIC/" version="1.1.0"/>			   
               <file category="include" name="Libraries/MiscDrivers/PushButton/" version="1.1.0"/>
               <file category="include" name="Libraries/MiscDrivers/Touchscreen/" version="1.1.0"/>				
               <file category="sourceC" name="Libraries/Boards/MAX32670/EvKit_V1/Source/board.c" version="1.1.0"/>	   			   
			   <file category="sourceC" name="Libraries/MiscDrivers/stdio.c" version="1.1.0"/>				
               <file category="sourceC" name="Libraries/Boards/MAX32670/FTHR_RevA/Source/board.c" version="1.1.0"/>	   			   
			   <file category="sourceC" name="Libraries/MiscDrivers/stdio.c" version="1.1.0"/>		   
           </files>
         </component> -->
	

<!--         <component Cgroup="Display" condition="MAX32670 BSP DEP">
            <description>MAX32670 Evaluation Kit Board Setup</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Display/adafruit_3315_tft.c" version="1.1.0"/>			   
               <file category="sourceC" name="Libraries/MiscDrivers/Display/tft_ili9341.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/MiscDrivers/Display/tft_ssd2119.c" version="1.1.0"/>	   
           </files>
         </component> -->
		 
         <!-- Types of Display -->                                                                   
         <component  Cgroup="Display" Cvariant="ADAFRUIT_3315_TFT" Cversion="1.1.0" condition="MAX32670 Family">
            <description>ADAFRUIT_3315</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Display/adafruit_3315_tft.c" version="1.1.0"/>			   
           </files>			
         </component>
         <component  Cgroup="Display" Cvariant="TFT_ILI9341" Cversion="1.1.0" condition="MAX32670 Family">
             <description>TFT_ILI9341</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Display/tft_ili9341.c" version="1.1.0"/>	   
           </files>			 
         </component>
         <component  Cgroup="Display" Cvariant="TFT_SSD2119" Cversion="1.1.0" condition="MAX32670 Family">
             <description>TFT_SSD2119</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Display/tft_ssd2119.c" version="1.1.0"/>	   
           </files>			 
         </component>


         <!-- Types of Camera -->
         <component  Cgroup="Camera" Cvariant="HM01B0" Cversion="1.1.0" condition="MAX32670 Family">
            <description>HM01B0</description>
            <RTE_Components_h>
               #define CAMERA_HM01B0
            </RTE_Components_h>			
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/sccb.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/camera.c" version="1.1.0"/>				
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/hm01b0.c" version="1.1.0"/>			   
           </files>			
         </component>
         <component  Cgroup="Camera" Cvariant="HM0360" Cversion="1.1.0" condition="MAX32670 Family">
            <description>HM0360</description>
            <RTE_Components_h>
               #define CAMERA_HM0360
            </RTE_Components_h>				
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/sccb.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/camera.c" version="1.1.0"/>				
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/hm0360_color.c" version="1.1.0"/>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/hm0360_mono.c" version="1.1.0"/>			   
           </files>			
         </component>
         <component  Cgroup="Camera" Cvariant="MIPI_CAMERA" Cversion="1.1.0" condition="MAX32670 Family">
            <description>MIPI CAMERA</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/sccb.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/camera.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/mipi_camera.c" version="1.1.0"/>			   
           </files>			
         </component>		 
         <component  Cgroup="Camera" Cvariant="OV5640" Cversion="1.1.0" condition="MAX32670 Family">
            <description>OV5640</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/sccb.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/camera.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/ov5640.c" version="1.1.0"/>			   
           </files>			
         </component>
         <component  Cgroup="Camera" Cvariant="OV5642" Cversion="1.1.0" condition="MAX32670 Family">
            <description>OV5642</description>
            <RTE_Components_h>
               #define CAMERA_OV5642
            </RTE_Components_h>				
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/sccb.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/camera.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/ov5642.c" version="1.1.0"/>			   
           </files>			
         </component>		 
