vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32670.pdsc
         <component Cgroup="Camera" Cvariant="OV7692" Cversion="1.1.0" condition="MAX32670 Family">
            <description>OV7692</description>
            <RTE_Components_h>
               #define CAMERA_OV7692
            </RTE_Components_h>			
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/sccb.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/camera.c" version="1.1.0"/>			
               <file category="sourceC" name="Libraries/MiscDrivers/Camera/ov7692.c" version="1.1.0"/>			   
           </files>			
         </component>
		 
		  <!-- Types of Touch Screen -->
          <component Cgroup="Touch Screen" Cvariant="ADAFRUIT 3315" Cversion="1.1.0" condition="MAX32670 BSP DEP">
            <description>ADAFRUIT 3315</description>
            <files>		
               <file category="sourceC" name="Libraries/MiscDrivers/Touchscreen/adafruit_3315_touch.c" version="1.1.0"/>		   		   		   
           </files>
         </component>	
          <component Cgroup="Touch Screen" Cvariant="TSC2046" Cversion="1.1.0" condition="MAX32670 BSP DEP">
            <description>TSC2046</description>
            <files>		   
               <file category="sourceC" name="Libraries/MiscDrivers/Touchscreen/tsc2046.c" version="1.1.0"/>			   		   		   
           </files>
         </component>	 
	
	
         <component Cgroup="LED" Cversion="1.1.0" condition="MAX32670 BSP DEP">
            <description>MAX32670 Evaluation Kit Board Setup</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/LED/led.c" version="1.1.0"/>		   		   
           </files>
         </component>	

         <component Cgroup="PMIC" Cversion="1.1.0" condition="MAX32670 BSP DEP">
            <description>MAX32670 Evaluation Kit Board Setup</description>
            <files>
               <file category="sourceC" name="Libraries/MiscDrivers/PMIC/max20303.c" version="1.1.0"/>			   		   
           </files>
         </component>

          <component Cgroup="Push Btn" Cversion="1.1.0" condition="MAX32670 BSP DEP">
            <description>MAX32670 Evaluation Kit Board Setup</description>
            <files>		   
               <file category="sourceC" name="Libraries/MiscDrivers/PushButton/pb.c" version="1.1.0"/>		   		   
           </files>
         </component>		 
	
      </bundle> 	  
	  
   </components>
</package>